In [1]:
from pyspark.sql import SparkSession

In [13]:
spark.stop()

In [3]:
spark = SparkSession.builder \
    .master("local") \
    .appName("PrimerasClases") \
    .getOrCreate()

In [5]:
data = [('James','','Smith','1991-04-01','M',3000),
  ('Michael','Rose','','2000-05-19','M',4000),
  ('Robert','','Williams','1978-09-05','M',4000),
  ('Maria','Anne','Jones','1967-12-01','F',4000),
  ('Jen','Mary','Brown','1980-02-17','F',-1)
]

columns = ["firstname","middlename","lastname","dob","gender","salary"]
df = spark.createDataFrame(data=data, schema = columns)

In [7]:
df.show()

+---------+----------+--------+----------+------+------+
|firstname|middlename|lastname|       dob|gender|salary|
+---------+----------+--------+----------+------+------+
|    James|          |   Smith|1991-04-01|     M|  3000|
|  Michael|      Rose|        |2000-05-19|     M|  4000|
|   Robert|          |Williams|1978-09-05|     M|  4000|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|
+---------+----------+--------+----------+------+------+

In [9]:
df.withColumn("Salary2",df.salary*2).show()

+---------+----------+--------+----------+------+------+-------+
|firstname|middlename|lastname|       dob|gender|salary|Salary2|
+---------+----------+--------+----------+------+------+-------+
|    James|          |   Smith|1991-04-01|     M|  3000|   6000|
|  Michael|      Rose|        |2000-05-19|     M|  4000|   8000|
|   Robert|          |Williams|1978-09-05|     M|  4000|   8000|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|   8000|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|     -2|
+---------+----------+--------+----------+------+------+-------+

In [11]:
import pandas as pd

data = [('James','','Smith','1991-04-01','M',3000),
  ('Michael','Rose','','2000-05-19','M',4000),
  ('Robert','','Williams','1978-09-05','M',4000),
  ('Maria','Anne','Jones','1967-12-01','F',4000),
  ('Jen','Mary','Brown','1980-02-17','F',-1)
]
columns = ["firstname","middlename","lastname","dob","gender","salary"]
dfp = pd.DataFrame(data, columns=columns)
dfp

  firstname middlename  lastname         dob gender  salary
0     James                Smith  1991-04-01      M    3000
1   Michael       Rose            2000-05-19      M    4000
2    Robert             Williams  1978-09-05      M    4000
3     Maria       Anne     Jones  1967-12-01      F    4000
4       Jen       Mary     Brown  1980-02-17      F      -1

In [12]:
dfp['Salary2'] = dfp.salary*2
dfp

  firstname middlename  lastname         dob gender  salary  Salary2
0     James                Smith  1991-04-01      M    3000     6000
1   Michael       Rose            2000-05-19      M    4000     8000
2    Robert             Williams  1978-09-05      M    4000     8000
3     Maria       Anne     Jones  1967-12-01      F    4000     8000
4       Jen       Mary     Brown  1980-02-17      F      -1       -2